
create_clock -name dco_clk -period 1500 -waveform {0 750} [get_ports dco_clk]
set_input_transition -rise -min 154 -clock dco_clk [get_ports dco_clk]
set_input_transition -fall -min 155 -clock dco_clk [get_ports dco_clk]
set_input_transition -rise -max 156 -clock dco_clk [get_ports dco_clk]
set_input_transition -fall -max 157 -clock dco_clk [get_ports dco_clk]
set_input_delay  -min -rise 150 -clock dco_clk [get_ports dco_clk]
set_input_delay  -min -fall 151 -clock dco_clk [get_ports dco_clk]
set_input_delay  -max -rise 152 -clock dco_clk [get_ports dco_clk]
set_input_delay  -max -fall 153 -clock dco_clk [get_ports dco_clk]
create_clock -name lfxt_clk -period 1600 -waveform {0 960} [get_ports lfxt_clk]
set_input_transition -rise -min 155 -clock lfxt_clk [get_ports lfxt_clk]
set_input_transition -fall -min 156 -clock lfxt_clk [get_ports lfxt_clk]
set_input_transition -rise -max 157 -clock lfxt_clk [get_ports lfxt_clk]
set_input_transition -fall -max 158 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay  -min -rise 151 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay  -min -fall 152 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay  -max -rise 153 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay  -max -fall 154 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay -clock  yet_to_decide1 -min -rise  100 [get_ports cpu_en]
set_input_delay -clock  yet_to_decide1 -min -fall  101 [get_ports cpu_en]
set_input_delay -clock  yet_to_decide1 -max -rise  102 [get_ports cpu_en]
set_input_delay -clock  yet_to_decide1 -max -fall  103 [get_ports cpu_en]
set_input_transition -clock  yet_to_decide1 -min -rise  150 [get_ports cpu_en]
set_input_transition -clock  yet_to_decide1 -min -fall  151 [get_ports cpu_en]
set_input_transition -clock  yet_to_decide1 -max -rise  152 [get_ports cpu_en]
set_input_transition -clock  yet_to_decide1 -max -fall  153 [get_ports cpu_en]
set_input_delay -clock  yet_to_decide2 -min -rise  101 [get_ports dbg_en]
set_input_delay -clock  yet_to_decide2 -min -fall  102 [get_ports dbg_en]
set_input_delay -clock  yet_to_decide2 -max -rise  103 [get_ports dbg_en]
set_input_delay -clock  yet_to_decide2 -max -fall  104 [get_ports dbg_en]
set_input_transition -clock  yet_to_decide2 -min -rise  151 [get_ports dbg_en]
set_input_transition -clock  yet_to_decide2 -min -fall  152 [get_ports dbg_en]
set_input_transition -clock  yet_to_decide2 -max -rise  153 [get_ports dbg_en]
set_input_transition -clock  yet_to_decide2 -max -fall  154 [get_ports dbg_en]
set_input_delay -clock  yet_to_decide3 -min -rise  102 [get_ports dbg_i2c_addr*]
set_input_delay -clock  yet_to_decide3 -min -fall  103 [get_ports dbg_i2c_addr*]
set_input_delay -clock  yet_to_decide3 -max -rise  104 [get_ports dbg_i2c_addr*]
set_input_delay -clock  yet_to_decide3 -max -fall  105 [get_ports dbg_i2c_addr*]
set_input_transition -clock  yet_to_decide3 -min -rise  152 [get_ports dbg_i2c_addr*]
set_input_transition -clock  yet_to_decide3 -min -fall  153 [get_ports dbg_i2c_addr*]
set_input_transition -clock  yet_to_decide3 -max -rise  154 [get_ports dbg_i2c_addr*]
set_input_transition -clock  yet_to_decide3 -max -fall  155 [get_ports dbg_i2c_addr*]
set_input_delay -clock  yet_to_decide4 -min -rise  103 [get_ports dbg_i2c_broadcast*]
set_input_delay -clock  yet_to_decide4 -min -fall  104 [get_ports dbg_i2c_broadcast*]
set_input_delay -clock  yet_to_decide4 -max -rise  105 [get_ports dbg_i2c_broadcast*]
set_input_delay -clock  yet_to_decide4 -max -fall  106 [get_ports dbg_i2c_broadcast*]
set_input_transition -clock  yet_to_decide4 -min -rise  153 [get_ports dbg_i2c_broadcast*]
set_input_transition -clock  yet_to_decide4 -min -fall  154 [get_ports dbg_i2c_broadcast*]
set_input_transition -clock  yet_to_decide4 -max -rise  155 [get_ports dbg_i2c_broadcast*]
set_input_transition -clock  yet_to_decide4 -max -fall  156 [get_ports dbg_i2c_broadcast*]
set_input_delay -clock  yet_to_decide5 -min -rise  104 [get_ports dbg_i2c_scl]
set_input_delay -clock  yet_to_decide5 -min -fall  105 [get_ports dbg_i2c_scl]
set_input_delay -clock  yet_to_decide5 -max -rise  106 [get_ports dbg_i2c_scl]
set_input_delay -clock  yet_to_decide5 -max -fall  107 [get_ports dbg_i2c_scl]
set_input_transition -clock  yet_to_decide5 -min -rise  154 [get_ports dbg_i2c_scl]
set_input_transition -clock  yet_to_decide5 -min -fall  155 [get_ports dbg_i2c_scl]
set_input_transition -clock  yet_to_decide5 -max -rise  156 [get_ports dbg_i2c_scl]
set_input_transition -clock  yet_to_decide5 -max -fall  157 [get_ports dbg_i2c_scl]
set_input_delay -clock  yet_to_decide6 -min -rise  105 [get_ports dbg_i2c_sda_in]
set_input_delay -clock  yet_to_decide6 -min -fall  106 [get_ports dbg_i2c_sda_in]
set_input_delay -clock  yet_to_decide6 -max -rise  107 [get_ports dbg_i2c_sda_in]
set_input_delay -clock  yet_to_decide6 -max -fall  108 [get_ports dbg_i2c_sda_in]
set_input_transition -clock  yet_to_decide6 -min -rise  155 [get_ports dbg_i2c_sda_in]
set_input_transition -clock  yet_to_decide6 -min -fall  156 [get_ports dbg_i2c_sda_in]
set_input_transition -clock  yet_to_decide6 -max -rise  157 [get_ports dbg_i2c_sda_in]
set_input_transition -clock  yet_to_decide6 -max -fall  158 [get_ports dbg_i2c_sda_in]
set_input_delay -clock  yet_to_decide7 -min -rise  106 [get_ports dbg_uart_rxd]
set_input_delay -clock  yet_to_decide7 -min -fall  107 [get_ports dbg_uart_rxd]
set_input_delay -clock  yet_to_decide7 -max -rise  108 [get_ports dbg_uart_rxd]
set_input_delay -clock  yet_to_decide7 -max -fall  109 [get_ports dbg_uart_rxd]
set_input_transition -clock  yet_to_decide7 -min -rise  156 [get_ports dbg_uart_rxd]
set_input_transition -clock  yet_to_decide7 -min -fall  157 [get_ports dbg_uart_rxd]
set_input_transition -clock  yet_to_decide7 -max -rise  158 [get_ports dbg_uart_rxd]
set_input_transition -clock  yet_to_decide7 -max -fall  159 [get_ports dbg_uart_rxd]
set_input_delay -clock  yet_to_decide8 -min -rise  108 [get_ports dmem_dout*]
set_input_delay -clock  yet_to_decide8 -min -fall  109 [get_ports dmem_dout*]
set_input_delay -clock  yet_to_decide8 -max -rise  110 [get_ports dmem_dout*]
set_input_delay -clock  yet_to_decide8 -max -fall  111 [get_ports dmem_dout*]
set_input_transition -clock  yet_to_decide8 -min -rise  158 [get_ports dmem_dout*]
set_input_transition -clock  yet_to_decide8 -min -fall  159 [get_ports dmem_dout*]
set_input_transition -clock  yet_to_decide8 -max -rise  160 [get_ports dmem_dout*]
set_input_transition -clock  yet_to_decide8 -max -fall  161 [get_ports dmem_dout*]
set_input_delay -clock  yet_to_decide9 -min -rise  109 [get_ports irq*]
set_input_delay -clock  yet_to_decide9 -min -fall  110 [get_ports irq*]
set_input_delay -clock  yet_to_decide9 -max -rise  111 [get_ports irq*]
set_input_delay -clock  yet_to_decide9 -max -fall  112 [get_ports irq*]
set_input_transition -clock  yet_to_decide9 -min -rise  159 [get_ports irq*]
set_input_transition -clock  yet_to_decide9 -min -fall  160 [get_ports irq*]
set_input_transition -clock  yet_to_decide9 -max -rise  161 [get_ports irq*]
set_input_transition -clock  yet_to_decide9 -max -fall  162 [get_ports irq*]
set_input_delay -clock  yet_to_decide10 -min -rise  111 [get_ports dma_addr*]
set_input_delay -clock  yet_to_decide10 -min -fall  112 [get_ports dma_addr*]
set_input_delay -clock  yet_to_decide10 -max -rise  113 [get_ports dma_addr*]
set_input_delay -clock  yet_to_decide10 -max -fall  114 [get_ports dma_addr*]
set_input_transition -clock  yet_to_decide10 -min -rise  161 [get_ports dma_addr*]
set_input_transition -clock  yet_to_decide10 -min -fall  162 [get_ports dma_addr*]
set_input_transition -clock  yet_to_decide10 -max -rise  163 [get_ports dma_addr*]
set_input_transition -clock  yet_to_decide10 -max -fall  164 [get_ports dma_addr*]
set_input_delay -clock  yet_to_decide11 -min -rise  112 [get_ports dma_din*]
set_input_delay -clock  yet_to_decide11 -min -fall  113 [get_ports dma_din*]
set_input_delay -clock  yet_to_decide11 -max -rise  114 [get_ports dma_din*]
set_input_delay -clock  yet_to_decide11 -max -fall  115 [get_ports dma_din*]
set_input_transition -clock  yet_to_decide11 -min -rise  162 [get_ports dma_din*]
set_input_transition -clock  yet_to_decide11 -min -fall  163 [get_ports dma_din*]
set_input_transition -clock  yet_to_decide11 -max -rise  164 [get_ports dma_din*]
set_input_transition -clock  yet_to_decide11 -max -fall  165 [get_ports dma_din*]
set_input_delay -clock  yet_to_decide12 -min -rise  113 [get_ports dma_en]
set_input_delay -clock  yet_to_decide12 -min -fall  114 [get_ports dma_en]
set_input_delay -clock  yet_to_decide12 -max -rise  115 [get_ports dma_en]
set_input_delay -clock  yet_to_decide12 -max -fall  116 [get_ports dma_en]
set_input_transition -clock  yet_to_decide12 -min -rise  163 [get_ports dma_en]
set_input_transition -clock  yet_to_decide12 -min -fall  164 [get_ports dma_en]
set_input_transition -clock  yet_to_decide12 -max -rise  165 [get_ports dma_en]
set_input_transition -clock  yet_to_decide12 -max -fall  166 [get_ports dma_en]
set_input_delay -clock  yet_to_decide13 -min -rise  114 [get_ports dma_priority]
set_input_delay -clock  yet_to_decide13 -min -fall  115 [get_ports dma_priority]
set_input_delay -clock  yet_to_decide13 -max -rise  116 [get_ports dma_priority]
set_input_delay -clock  yet_to_decide13 -max -fall  117 [get_ports dma_priority]
set_input_transition -clock  yet_to_decide13 -min -rise  164 [get_ports dma_priority]
set_input_transition -clock  yet_to_decide13 -min -fall  165 [get_ports dma_priority]
set_input_transition -clock  yet_to_decide13 -max -rise  166 [get_ports dma_priority]
set_input_transition -clock  yet_to_decide13 -max -fall  167 [get_ports dma_priority]
set_input_delay -clock  yet_to_decide14 -min -rise  115 [get_ports dma_we*]
set_input_delay -clock  yet_to_decide14 -min -fall  116 [get_ports dma_we*]
set_input_delay -clock  yet_to_decide14 -max -rise  117 [get_ports dma_we*]
set_input_delay -clock  yet_to_decide14 -max -fall  118 [get_ports dma_we*]
set_input_transition -clock  yet_to_decide14 -min -rise  165 [get_ports dma_we*]
set_input_transition -clock  yet_to_decide14 -min -fall  166 [get_ports dma_we*]
set_input_transition -clock  yet_to_decide14 -max -rise  167 [get_ports dma_we*]
set_input_transition -clock  yet_to_decide14 -max -fall  168 [get_ports dma_we*]
set_input_delay -clock  yet_to_decide15 -min -rise  116 [get_ports dma_wkup]
set_input_delay -clock  yet_to_decide15 -min -fall  117 [get_ports dma_wkup]
set_input_delay -clock  yet_to_decide15 -max -rise  118 [get_ports dma_wkup]
set_input_delay -clock  yet_to_decide15 -max -fall  119 [get_ports dma_wkup]
set_input_transition -clock  yet_to_decide15 -min -rise  166 [get_ports dma_wkup]
set_input_transition -clock  yet_to_decide15 -min -fall  167 [get_ports dma_wkup]
set_input_transition -clock  yet_to_decide15 -max -rise  168 [get_ports dma_wkup]
set_input_transition -clock  yet_to_decide15 -max -fall  169 [get_ports dma_wkup]
set_input_delay -clock  yet_to_decide16 -min -rise  117 [get_ports nmi]
set_input_delay -clock  yet_to_decide16 -min -fall  118 [get_ports nmi]
set_input_delay -clock  yet_to_decide16 -max -rise  119 [get_ports nmi]
set_input_delay -clock  yet_to_decide16 -max -fall  120 [get_ports nmi]
set_input_transition -clock  yet_to_decide16 -min -rise  167 [get_ports nmi]
set_input_transition -clock  yet_to_decide16 -min -fall  168 [get_ports nmi]
set_input_transition -clock  yet_to_decide16 -max -rise  169 [get_ports nmi]
set_input_transition -clock  yet_to_decide16 -max -fall  170 [get_ports nmi]
set_input_delay -clock  yet_to_decide17 -min -rise  118 [get_ports per_dout*]
set_input_delay -clock  yet_to_decide17 -min -fall  119 [get_ports per_dout*]
set_input_delay -clock  yet_to_decide17 -max -rise  120 [get_ports per_dout*]
set_input_delay -clock  yet_to_decide17 -max -fall  121 [get_ports per_dout*]
set_input_transition -clock  yet_to_decide17 -min -rise  168 [get_ports per_dout*]
set_input_transition -clock  yet_to_decide17 -min -fall  169 [get_ports per_dout*]
set_input_transition -clock  yet_to_decide17 -max -rise  170 [get_ports per_dout*]
set_input_transition -clock  yet_to_decide17 -max -fall  171 [get_ports per_dout*]
set_input_delay -clock  yet_to_decide18 -min -rise  119 [get_ports pmem_dout*]
set_input_delay -clock  yet_to_decide18 -min -fall  120 [get_ports pmem_dout*]
set_input_delay -clock  yet_to_decide18 -max -rise  121 [get_ports pmem_dout*]
set_input_delay -clock  yet_to_decide18 -max -fall  122 [get_ports pmem_dout*]
set_input_transition -clock  yet_to_decide18 -min -rise  169 [get_ports pmem_dout*]
set_input_transition -clock  yet_to_decide18 -min -fall  170 [get_ports pmem_dout*]
set_input_transition -clock  yet_to_decide18 -max -rise  171 [get_ports pmem_dout*]
set_input_transition -clock  yet_to_decide18 -max -fall  172 [get_ports pmem_dout*]
set_input_delay -clock  yet_to_decide19 -min -rise  120 [get_ports reset_n]
set_input_delay -clock  yet_to_decide19 -min -fall  121 [get_ports reset_n]
set_input_delay -clock  yet_to_decide19 -max -rise  122 [get_ports reset_n]
set_input_delay -clock  yet_to_decide19 -max -fall  123 [get_ports reset_n]
set_input_transition -clock  yet_to_decide19 -min -rise  170 [get_ports reset_n]
set_input_transition -clock  yet_to_decide19 -min -fall  171 [get_ports reset_n]
set_input_transition -clock  yet_to_decide19 -max -rise  172 [get_ports reset_n]
set_input_transition -clock  yet_to_decide19 -max -fall  173 [get_ports reset_n]
set_input_delay -clock  yet_to_decide20 -min -rise  121 [get_ports scan_enable]
set_input_delay -clock  yet_to_decide20 -min -fall  122 [get_ports scan_enable]
set_input_delay -clock  yet_to_decide20 -max -rise  123 [get_ports scan_enable]
set_input_delay -clock  yet_to_decide20 -max -fall  124 [get_ports scan_enable]
set_input_transition -clock  yet_to_decide20 -min -rise  171 [get_ports scan_enable]
set_input_transition -clock  yet_to_decide20 -min -fall  172 [get_ports scan_enable]
set_input_transition -clock  yet_to_decide20 -max -rise  173 [get_ports scan_enable]
set_input_transition -clock  yet_to_decide20 -max -fall  174 [get_ports scan_enable]
set_input_delay -clock  yet_to_decide21 -min -rise  122 [get_ports scan_mode]
set_input_delay -clock  yet_to_decide21 -min -fall  123 [get_ports scan_mode]
set_input_delay -clock  yet_to_decide21 -max -rise  124 [get_ports scan_mode]
set_input_delay -clock  yet_to_decide21 -max -fall  125 [get_ports scan_mode]
set_input_transition -clock  yet_to_decide21 -min -rise  172 [get_ports scan_mode]
set_input_transition -clock  yet_to_decide21 -min -fall  173 [get_ports scan_mode]
set_input_transition -clock  yet_to_decide21 -max -rise  174 [get_ports scan_mode]
set_input_transition -clock  yet_to_decide21 -max -fall  175 [get_ports scan_mode]